ChartsOfCharacteristicTypes/МИКО_мвНастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>МИКО_мвНастройкиМаршрутизации</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>6</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.МИКО_мвНастройкиМаршрутизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

InformationRegisters/МИКО_опИндексНомераТелефонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_опИндексНомераТелефонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерТелефонаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерТелефонаИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МИКО_мвДанныеПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МИКО_мвДанныеПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчаствуетВГолосовомМеню</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_РП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ДП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ВП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ТП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО_ПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолПользователя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МИКО_мвПолПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/МИКО_мвНастройкиМаршрутизации/Ext/ManagerModule.bsl
// #Область СлужебныеПроцедурыИФункции

Функция СформироватьСписокСотрудников(Падеж, СоставИмени) Экспорт
	
	Результат = Новый Массив;
	
	// Выберем из базы несколько сотрудников для демонстрации
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыКонтактнойИнформации", ПланыВидовХарактеристик.МИКО_мвНастройкиМаршрутизации.ВидТелефона.Значение);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	Пользователи.Наименование КАК СотрудникФИО,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК Представление,
		|	ТелефонныйСправочник.НомерТелефонаСтрокой КАК Добавочный,
		|	МИКО_мвДанныеПользователей.ФИО_РП,
		|	МИКО_мвДанныеПользователей.ФИО_ДП,
		|	МИКО_мвДанныеПользователей.ФИО_ВП,
		|	МИКО_мвДанныеПользователей.ФИО_ТП,
		|	МИКО_мвДанныеПользователей.ФИО_ПП
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МИКО_опИндексНомераТелефонов КАК ТелефонныйСправочник
		|		ПО Пользователи.Ссылка = (ВЫРАЗИТЬ(ТелефонныйСправочник.СсылкаНаКлиента КАК Справочник.Пользователи))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МИКО_мвДанныеПользователей КАК МИКО_мвДанныеПользователей
		|		ПО (МИКО_мвДанныеПользователей.Пользователь = Пользователи.Ссылка)
		|ГДЕ
		|	Пользователи.ПометкаУдаления = ЛОЖЬ
		|	И ТелефонныйСправочник.НомерТелефонаСтрокой <> НЕОПРЕДЕЛЕНО
		|	И МИКО_мвДанныеПользователей.УчаствуетВГолосовомМеню";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаСотрудников = РезультатЗапроса.Выгрузить();
	
	СтрокиКУдалению = Новый Массив;
	
	Для каждого СотрудникСтр Из ТаблицаСотрудников Цикл
	
		Если НЕ ЗначениеЗаполнено(СотрудникСтр.Добавочный) ИЛИ СтрДлина(СотрудникСтр.Добавочный) > 4 Тогда
			СтрокиКУдалению.Добавить(СотрудникСтр);
		КонецЕсли; 
	
	КонецЦикла; 
	
	Для каждого УдаляемаяСтрока Из СтрокиКУдалению Цикл
		ТаблицаСотрудников.Удалить(УдаляемаяСтрока);
	КонецЦикла; 
	
	Если ТаблицаСотрудников.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Выберем из загруженного списка пару случайных сотрудников
	
	ГСЧ = Новый ГенераторСлучайныхЧисел(1);
	ИндексСотрудника1 = ГСЧ.СлучайноеЧисло(0, ТаблицаСотрудников.Количество() - 1);
	ИндексСотрудника2 = ГСЧ.СлучайноеЧисло(0, ТаблицаСотрудников.Количество() - 1);
	
	// Формируем список из имен сотрудников
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(ТаблицаСотрудников[ИндексСотрудника1]);
	Если ИндексСотрудника1 <> ИндексСотрудника2 Тогда
		МассивСотрудников.Добавить(ТаблицаСотрудников[ИндексСотрудника2]);
	КонецЕсли;
	
	// Преобразуем имена
	
	Для Каждого СтрокаСотрудник Из МассивСотрудников Цикл
	
		// Просклоняем имя сотрудника
		Если Падеж = 2 Тогда
			СтрокаСотрудник.Представление = СтрокаСотрудник.ФИО_РП;
		ИначеЕсли Падеж = 3 Тогда
			СтрокаСотрудник.Представление = СтрокаСотрудник.ФИО_ДП;
		ИначеЕсли Падеж = 4 Тогда
			СтрокаСотрудник.Представление = СтрокаСотрудник.ФИО_ВП;
		ИначеЕсли Падеж = 5 Тогда
			СтрокаСотрудник.Представление = СтрокаСотрудник.ФИО_ТП;
		ИначеЕсли Падеж = 6 Тогда
			СтрокаСотрудник.Представление = СтрокаСотрудник.ФИО_ПП;
		Иначе
			СтрокаСотрудник.Представление = СтрокаСотрудник.СотрудникФИО;
		КонецЕсли;
		
		// Обрезаем лишнии части ФИО
		Если СоставИмени <> 0 Тогда
		
			ЧастиФИО = МИКО_стОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаСотрудник.Представление, " ");
			
			Если СоставИмени = 1 Тогда
				// Оставляем фамилию и имя
				СтрокаСотрудник.Представление = ?(ЧастиФИО.Количество() > 0, ЧастиФИО[0] + " ", "") + ?(ЧастиФИО.Количество() > 1, ЧастиФИО[1], "");
			ИначеЕсли СоставИмени = 2 Тогда
				// Оставляем имя и отчество
				СтрокаСотрудник.Представление = ?(ЧастиФИО.Количество() > 1, ЧастиФИО[1] + " ", "") + ?(ЧастиФИО.Количество() > 2, ЧастиФИО[2], "");
			КонецЕсли;
			
		КонецЕсли;
		
		// Формируем итоговую строку
		Результат.Добавить(СтрокаСотрудник.Представление + ", добавочный " + СтрокаСотрудник.Добавочный);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СформироватьПримерОповещения()

Функция ЗагрузитьСписокДикторов() Экспорт
	
	Адрес  = "voicefabric.ru";
	Ресурс = "/main";
	
	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = Ресурс;
	
	HTTPСоединение = Новый HTTPСоединение(Адрес,,,,, 5, Новый ЗащищенноеСоединениеOpenSSL);
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	HtmlОтвет = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(HtmlОтвет);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеHTML);
	
	ЭлементСписокДикторов = ДокументDOM.ПолучитьЭлементПоИдентификатору("voiceSelect");
	
	Результат = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из ЭлементСписокДикторов.ДочерниеУзлы Цикл
		
		ДикторИдентификтор  = ЭлементСписка.Атрибуты.ПолучитьИменованныйЭлемент("value").Значение;
		ДикторПредставление = ЭлементСписка.ТекстовоеСодержимое;
		
		// Выбираем только дикторов с частотой 8 кГц
		Если Найти(ДикторИдентификтор, "8000") > 0 Тогда
			Результат.Добавить(ДикторИдентификтор, ДикторПредставление);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ЗагрузитьСписокДикторов()

// #КонецОбласти
